In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)

In [3]:
df =pd. DataFrame(np.random.randint(-2, 8, (5,4)), 
                  index = ['A', 'B','C', 'D', 'E'],
                  columns = ['W', 'X','Y', 'Z'])

In [4]:
df

   W  X  Y  Z
A -1  4  5  7
B  6  2  6  3
C -2  3  6 -1
D  1  6  1  1
E  0  6  7  1

In [5]:
df > 0

       W     X     Y      Z
A  False  True  True   True
B   True  True  True   True
C  False  True  True  False
D   True  True  True   True
E  False  True  True   True

In [6]:
df[df > 0] # conditional selection

     W  X  Y    Z
A  NaN  4  5  7.0
B  6.0  2  6  3.0
C  NaN  3  6  NaN
D  1.0  6  1  1.0
E  NaN  6  7  1.0

In [7]:
 df > 0

       W     X     Y      Z
A  False  True  True   True
B   True  True  True   True
C  False  True  True  False
D   True  True  True   True
E  False  True  True   True

In [8]:
df[df>0]

     W  X  Y    Z
A  NaN  4  5  7.0
B  6.0  2  6  3.0
C  NaN  3  6  NaN
D  1.0  6  1  1.0
E  NaN  6  7  1.0

In [9]:
df[df['Z']> 0] # conditional selection wrt column

   W  X  Y  Z
A -1  4  5  7
B  6  2  6  3
D  1  6  1  1
E  0  6  7  1

In [10]:
df[df['W']< 0]# fiters out row depending on the condition of column

   W  X  Y  Z
A -1  4  5  7
C -2  3  6 -1

In [11]:
df['W'] < 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [14]:
df[df['W'] < 0]['X'] # returns the x column

A    4
C    3
Name: X, dtype: int32

In [15]:
df[df['W'] < 0][['X', 'Y']]

   X  Y
A  4  5
C  3  6

In [16]:
df['W'] < 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [17]:
(df['X'] > 0 ) & (df['Y'] > 1)

A     True
B     True
C     True
D    False
E     True
dtype: bool

In [18]:
df[(df['X'] > 0 ) & (df['Y'] > 1)]

   W  X  Y  Z
A -1  4  5  7
B  6  2  6  3
C -2  3  6 -1
E  0  6  7  1

In [19]:
df[(df['X'] > 0 ) | (df['Y'] > 1)] # multiple conditions

   W  X  Y  Z
A -1  4  5  7
B  6  2  6  3
C -2  3  6 -1
D  1  6  1  1
E  0  6  7  1

In [20]:
(df['X'] > 0 ) | (df['Y'] > 1)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [21]:
df.reset_index() # index becomes the column

  index  W  X  Y  Z
0     A -1  4  5  7
1     B  6  2  6  3
2     C -2  3  6 -1
3     D  1  6  1  1
4     E  0  6  7  1

In [22]:
df

   W  X  Y  Z
A -1  4  5  7
B  6  2  6  3
C -2  3  6 -1
D  1  6  1  1
E  0  6  7  1

In [23]:
df.reset_index(inplace = True) # modifies the dataframe if inplace is True

In [24]:
df

  index  W  X  Y  Z
0     A -1  4  5  7
1     B  6  2  6  3
2     C -2  3  6 -1
3     D  1  6  1  1
4     E  0  6  7  1

In [25]:
df =pd. DataFrame(np.random.randint(-2, 8, (5,4)), 
                  index = ['A', 'B','C', 'D', 'E'],
                  columns = ['W', 'X','Y', 'Z'])

In [26]:
df

   W  X  Y  Z
A  5 -2  7  5
B  7  6  2  1
C  1  5  2  6
D  5  4  7  2
E  0  5  5  5

In [27]:
newindex = 'INDIA NEPAL PAKISTAN SRILANKA THAILAND '.split()

In [28]:
newindex

['INDIA', 'NEPAL', 'PAKISTAN', 'SRILANKA', 'THAILAND']

In [29]:
df['Country'] =  newindex

In [30]:
df

   W  X  Y  Z   Country
A  5 -2  7  5     INDIA
B  7  6  2  1     NEPAL
C  1  5  2  6  PAKISTAN
D  5  4  7  2  SRILANKA
E  0  5  5  5  THAILAND